package daily_price

import (
	lb "github.com/ghts/ghts/lib"
	"testing"
)

func TestS일일_가격정보_모음(t *testing.T) {
	일일_가격정보_1 := New일일_가격정보(
		"000000",
		lb.F확인2(lb.F2포맷된_일자("2006-01-02", "2000-01-01")),
		1, 2, 3, 4, 5)

	일일_가격정보_2 := New일일_가격정보(
		"000000",
		lb.F확인2(lb.F2포맷된_일자("2006-01-02", "2000-01-02")),
		2, 3, 4, 5, 6)

	일일_가격정보_3 := New일일_가격정보(
		"111111",
		lb.F확인2(lb.F2포맷된_일자("2006-01-02", "2000-01-03")),
		3, 4, 5, 6, 7)

	종목별_일일_가격정보_모음, 에러 := New종목별_일일_가격정보_모음([]*S일일_가격정보{
		일일_가격정보_2,
		일일_가격정보_1})

	lb.F테스트_에러없음(t, 에러)
	lb.F테스트_같음(t, len(종목별_일일_가격정보_모음.M저장소), 2)
	lb.F테스트_같음(t, len(종목별_일일_가격정보_모음.인덱스), 2)
	lb.F테스트_참임(t, 종목별_일일_가격정보_모음.M저장소[0].M일자 < 종목별_일일_가격정보_모음.M저장소[1].M일자)
	lb.F테스트_같음(t, 종목별_일일_가격정보_모음.G종목코드(), "000000")

	값, 에러 := 종목별_일일_가격정보_모음.G값(일일_가격정보_1.M일자)
	lb.F테스트_에러없음(t, 에러)
	lb.F테스트_같음(t, 값.M일자, 일일_가격정보_1.M일자)

	값, 에러 = 종목별_일일_가격정보_모음.G값(일일_가격정보_3.M일자)
	lb.F테스트_에러발생(t, 에러)
	lb.F테스트_같음(t, 값, nil)
}
