package xt

import (
	"github.com/ghts/ghts/lib"
	"reflect"
	"strings"
	"testing"
)

func TestP자료형_문자열(t *testing.T) {
	lib.F테스트_같음(t, P자료형_nil, f자료형_문자열(nil))
	lib.F테스트_같음(t, P자료형_S현물_주문_응답_실시간_정보, f자료형_문자열(S현물_주문_응답_실시간_정보{}))
	lib.F테스트_같음(t, P자료형_CFOAQ00600_선물옵션_주문체결내역_질의값, f자료형_문자열(CFOAQ00600_선물옵션_주문체결내역_질의값{}))
	//lib.F테스트_같음(t, P자료형_CFOAQ00600OutBlock, f자료형_문자열(CFOAQ00600OutBlock{}
	lib.F테스트_같음(t, P자료형_CFOAT00100_선물옵션_정상주문_질의값, f자료형_문자열(CFOAT00100_선물옵션_정상주문_질의값{}))
	//lib.F테스트_같음(t, P자료형_CFOAT00100OutBlock, f자료형_문자열(             = "CFOAT00100OutBlock"
	lib.F테스트_같음(t, P자료형_CFOAT00200_선물옵션_정정주문_질의값, f자료형_문자열(CFOAT00200_선물옵션_정정주문_질의값{}))
	//lib.F테스트_같음(t, P자료형_CFOAT00200OutBlock, f자료형_문자열(             = "CFOAT00200OutBlock"
	lib.F테스트_같음(t, P자료형_CFOAT00300_선물옵션_취소주문_질의값, f자료형_문자열(CFOAT00300_선물옵션_취소주문_질의값{}))
	//lib.F테스트_같음(t, P자료형_CFOAT00300OutBlock, f자료형_문자열(             = "CFOAT00300OutBlock"
	lib.F테스트_같음(t, P자료형_CFOBQ10500_선물옵션_예탁금_증거금_조회_질의값, f자료형_문자열(CFOBQ10500_선물옵션_예탁금_증거금_조회_질의값{}))
	//lib.F테스트_같음(t, P자료형_CFOBQ10500OutBlock, f자료형_문자열(             = "CFOBQ10500OutBlock"
	lib.F테스트_같음(t, P자료형_CFOFQ02400_선물옵션_미결제약정_질의값, f자료형_문자열(CFOFQ02400_선물옵션_미결제약정_질의값{}))
	//lib.F테스트_같음(t, P자료형_CFOFQ02400OutBlock, f자료형_문자열(             = "CFOFQ02400OutBlock"
	lib.F테스트_같음(t, P자료형_CSPAT00600_현물_정상_주문_질의값, f자료형_문자열(CSPAT00600_현물_정상_주문_질의값{}))
	lib.F테스트_같음(t, P자료형_CSPAT00600OutBlock, f자료형_문자열(CSPAT00600OutBlock{}))
	lib.F테스트_같음(t, P자료형_CSPAT00700_현물_정정_주문_질의값, f자료형_문자열(CSPAT00700_현물_정정_주문_질의값{}))
	lib.F테스트_같음(t, P자료형_CSPAT00700OutBlock, f자료형_문자열(CSPAT00700OutBlock{}))
	lib.F테스트_같음(t, P자료형_CSPAT00800OutBlock, f자료형_문자열(CSPAT00800OutBlock{}))
	lib.F테스트_같음(t, P자료형_T0150_현물_당일_매매일지_질의값, f자료형_문자열(T0150_현물_당일_매매일지_질의값{}))
	lib.F테스트_같음(t, P자료형_T0150_현물_당일_매매일지_응답, f자료형_문자열(T0150_현물_당일_매매일지_응답{}))
	lib.F테스트_같음(t, P자료형_T0150_현물_당일_매매일지_응답_헤더, f자료형_문자열(T0150_현물_당일_매매일지_응답_헤더{}))
	lib.F테스트_같음(t, P자료형_T0150_현물_당일_매매일지_응답_반복값, f자료형_문자열(T0150_현물_당일_매매일지_응답_반복값{}))
	lib.F테스트_같음(t, P자료형_T0150OutBlock, f자료형_문자열(T0150OutBlock{}))
	lib.F테스트_같음(t, P자료형_T0150OutBlock1, f자료형_문자열(T0150OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T0151_현물_일자별_매매일지_질의값, f자료형_문자열(T0151_현물_일자별_매매일지_질의값{}))
	lib.F테스트_같음(t, P자료형_T0151_현물_일자별_매매일지_응답, f자료형_문자열(T0151_현물_일자별_매매일지_응답{}))
	lib.F테스트_같음(t, P자료형_T0151_현물_일자별_매매일지_응답_헤더, f자료형_문자열(T0151_현물_일자별_매매일지_응답_헤더{}))
	lib.F테스트_같음(t, P자료형_T0151_현물_일자별_매매일지_응답_반복값, f자료형_문자열(T0151_현물_일자별_매매일지_응답_반복값{}))
	lib.F테스트_같음(t, P자료형_T0151OutBlock, f자료형_문자열(T0151OutBlock{}))
	lib.F테스트_같음(t, P자료형_T0151OutBlock1, f자료형_문자열(T0151OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T0167OutBlock, f자료형_문자열(T0167OutBlock{}))
	lib.F테스트_같음(t, P자료형_T0425_현물_체결_미체결_조회_질의값, f자료형_문자열(T0425_현물_체결_미체결_조회_질의값{}))
	lib.F테스트_같음(t, P자료형_T0425OutBlock, f자료형_문자열(T0425OutBlock{}))
	lib.F테스트_같음(t, P자료형_T1101_현물_호가_조회_응답, f자료형_문자열(T1101_현물_호가_조회_응답{}))
	lib.F테스트_같음(t, P자료형_T1101OutBlock, f자료형_문자열(T1101OutBlock{}))
	lib.F테스트_같음(t, P자료형_T1102_현물_시세_조회_응답, f자료형_문자열(T1102_현물_시세_조회_응답{}))
	lib.F테스트_같음(t, P자료형_T1102OutBlock, f자료형_문자열(T1102OutBlock{}))
	lib.F테스트_같음(t, P자료형_T1301_현물_시간대별_체결_응답, f자료형_문자열(T1301_현물_시간대별_체결_응답{}))
	lib.F테스트_같음(t, P자료형_T1301_현물_시간대별_체결_응답_헤더, f자료형_문자열(T1301_현물_시간대별_체결_응답_헤더{}))
	lib.F테스트_같음(t, P자료형_T1301_현물_시간대별_체결_응답_반복값, f자료형_문자열(T1301_현물_시간대별_체결_응답_반복값{}))
	lib.F테스트_같음(t, P자료형_T1301_현물_시간대별_체결_응답_반복값_모음, f자료형_문자열(T1301_현물_시간대별_체결_응답_반복값_모음{}))
	lib.F테스트_같음(t, P자료형_T1305_현물_기간별_조회_질의값, f자료형_문자열(T1305_현물_기간별_조회_질의값{}))
	lib.F테스트_같음(t, P자료형_T1305_현물_기간별_조회_응답, f자료형_문자열(T1305_현물_기간별_조회_응답{}))
	lib.F테스트_같음(t, P자료형_T1305_현물_기간별_조회_응답_헤더, f자료형_문자열(T1305_현물_기간별_조회_응답_헤더{}))
	lib.F테스트_같음(t, P자료형_T1305_현물_기간별_조회_응답_반복값, f자료형_문자열(T1305_현물_기간별_조회_응답_반복값{}))
	lib.F테스트_같음(t, P자료형_T1305_현물_기간별_조회_응답_반복값_모음, f자료형_문자열(T1305_현물_기간별_조회_응답_반복값_모음{}))
	lib.F테스트_같음(t, P자료형_T1305OutBlock, f자료형_문자열(T1305OutBlock{}))
	lib.F테스트_같음(t, P자료형_T1305OutBlock1, f자료형_문자열(T1305OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T1310_현물_전일당일분틱조회_질의값, f자료형_문자열(T1310_현물_전일당일분틱조회_질의값{}))
	lib.F테스트_같음(t, P자료형_T1310_현물_전일당일분틱조회_응답, f자료형_문자열(T1310_현물_전일당일분틱조회_응답{}))
	lib.F테스트_같음(t, P자료형_T1310_현물_전일당일분틱조회_응답_헤더, f자료형_문자열(T1310_현물_전일당일분틱조회_응답_헤더{}))
	lib.F테스트_같음(t, P자료형_T1310_현물_전일당일분틱조회_응답_반복값, f자료형_문자열(T1310_현물_전일당일분틱조회_응답_반복값{}))
	lib.F테스트_같음(t, P자료형_T1310_현물_전일당일분틱조회_응답_반복값_모음, f자료형_문자열(T1310_현물_전일당일분틱조회_응답_반복값_모음{}))
	lib.F테스트_같음(t, P자료형_T1310OutBlock, f자료형_문자열(T1310OutBlock{}))
	lib.F테스트_같음(t, P자료형_T1310OutBlock1, f자료형_문자열(T1310OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T1404_관리종목_조회_질의값, f자료형_문자열(T1404_관리종목_조회_질의값{}))
	lib.F테스트_같음(t, P자료형_T1404OutBlock, f자료형_문자열(T1404OutBlock{}))
	lib.F테스트_같음(t, P자료형_T1404OutBlock1, f자료형_문자열(T1404OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T1405_투자경고_조회_질의값, f자료형_문자열(T1405_투자경고_조회_질의값{}))
	lib.F테스트_같음(t, P자료형_T1405OutBlock, f자료형_문자열(T1405OutBlock{}))
	lib.F테스트_같음(t, P자료형_T1405OutBlock1, f자료형_문자열(T1405OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T1901_ETF_현재가_조회_응답, f자료형_문자열(T1901_ETF_현재가_조회_응답{}))
	lib.F테스트_같음(t, P자료형_T1902_ETF시간별_추이_응답, f자료형_문자열(T1902_ETF시간별_추이_응답{}))
	lib.F테스트_같음(t, P자료형_T1902_ETF시간별_추이_응답_헤더, f자료형_문자열(T1902_ETF시간별_추이_응답_헤더{}))
	lib.F테스트_같음(t, P자료형_T1902_ETF시간별_추이_응답_반복값, f자료형_문자열(T1902_ETF시간별_추이_응답_반복값{}))
	lib.F테스트_같음(t, P자료형_T1902_ETF시간별_추이_응답_반복값_모음, f자료형_문자열(T1902_ETF시간별_추이_응답_반복값_모음{}))
	lib.F테스트_같음(t, P자료형_T1902OutBlock, f자료형_문자열(T1902OutBlock{}))
	lib.F테스트_같음(t, P자료형_T1902OutBlock1, f자료형_문자열(T1902OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T3320_기업정보_요약_응답, f자료형_문자열(T3320_기업정보_요약_응답{}))
	lib.F테스트_같음(t, P자료형_T3320_기업정보_요약_응답1, f자료형_문자열(T3320_기업정보_요약_응답1{}))
	lib.F테스트_같음(t, P자료형_T3320_기업정보_요약_응답2, f자료형_문자열(T3320_기업정보_요약_응답2{}))
	lib.F테스트_같음(t, P자료형_T3320OutBlock, f자료형_문자열(T3320OutBlock{}))
	lib.F테스트_같음(t, P자료형_T3320OutBlock1, f자료형_문자열(T3320OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T3341_재무순위_질의값, f자료형_문자열(T3341_재무순위_질의값{}))
	lib.F테스트_같음(t, P자료형_T3341OutBlock, f자료형_문자열(T3341OutBlock{}))
	lib.F테스트_같음(t, P자료형_T3341OutBlock1, f자료형_문자열(T3341OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T8411_현물_차트_틱_질의값, f자료형_문자열(T8411_현물_차트_틱_질의값{}))
	lib.F테스트_같음(t, P자료형_T8411_현물_차트_틱_응답, f자료형_문자열(T8411_현물_차트_틱_응답{}))
	lib.F테스트_같음(t, P자료형_T8411_현물_차트_틱_응답_헤더, f자료형_문자열(T8411_현물_차트_틱_응답_헤더{}))
	lib.F테스트_같음(t, P자료형_T8411_현물_차트_틱_응답_반복값, f자료형_문자열(T8411_현물_차트_틱_응답_반복값{}))
	lib.F테스트_같음(t, P자료형_T8411_현물_차트_틱_응답_반복값_모음, f자료형_문자열(T8411_현물_차트_틱_응답_반복값_모음{}))
	lib.F테스트_같음(t, P자료형_T8411OutBlock, f자료형_문자열(T8411OutBlock{}))
	lib.F테스트_같음(t, P자료형_T8411OutBlock1, f자료형_문자열(T8411OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T8412_현물_차트_분_질의값, f자료형_문자열(T8412_현물_차트_분_질의값{}))
	lib.F테스트_같음(t, P자료형_T8412_현물_차트_분_응답, f자료형_문자열(T8412_현물_차트_분_응답{}))
	lib.F테스트_같음(t, P자료형_T8412_현물_차트_분_응답_헤더, f자료형_문자열(T8412_현물_차트_분_응답_헤더{}))
	lib.F테스트_같음(t, P자료형_T8412_현물_차트_분_응답_반복값, f자료형_문자열(T8412_현물_차트_분_응답_반복값{}))
	lib.F테스트_같음(t, P자료형_T8412_현물_차트_분_응답_반복값_모음, f자료형_문자열(T8412_현물_차트_분_응답_반복값_모음{}))
	lib.F테스트_같음(t, P자료형_T8412OutBlock, f자료형_문자열(T8412OutBlock{}))
	lib.F테스트_같음(t, P자료형_T8412OutBlock1, f자료형_문자열(T8412OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T8413_현물_차트_일주월_질의값, f자료형_문자열(T8413_현물_차트_일주월_질의값{}))
	lib.F테스트_같음(t, P자료형_T8413_현물_차트_일주월_응답, f자료형_문자열(T8413_현물_차트_일주월_응답{}))
	lib.F테스트_같음(t, P자료형_T8413_현물_차트_일주월_응답_헤더, f자료형_문자열(T8413_현물_차트_일주월_응답_헤더{}))
	lib.F테스트_같음(t, P자료형_T8413_현물_차트_일주월_응답_반복값, f자료형_문자열(T8413_Value{}))
	lib.F테스트_같음(t, P자료형_T8413_S현물_차트_일주월_응답_반복값_모음, f자료형_문자열(T8413_현물_차트_일주월_응답_반복값_모음{}))
	lib.F테스트_같음(t, P자료형_T8413OutBlock, f자료형_문자열(T8413OutBlock{}))
	lib.F테스트_같음(t, P자료형_T8413OutBlock1, f자료형_문자열(T8413OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T8428_증시주변_자금추이_질의값, f자료형_문자열(T8428_증시주변_자금추이_질의값{}))
	lib.F테스트_같음(t, P자료형_T8428_증시주변_자금추이_응답, f자료형_문자열(T8428_증시주변_자금추이_응답{}))
	lib.F테스트_같음(t, P자료형_T8428_증시주변_자금추이_응답_헤더, f자료형_문자열(T8428_증시주변_자금추이_응답_헤더{}))
	lib.F테스트_같음(t, P자료형_T8428_증시주변_자금추이_응답_반복값, f자료형_문자열(T8428_증시주변_자금추이_응답_반복값{}))
	lib.F테스트_같음(t, P자료형_T8428_증시주변_자금추이_응답_반복값_모음, f자료형_문자열(T8428_증시주변_자금추이_응답_반복값_모음{}))
	lib.F테스트_같음(t, P자료형_T8428OutBlock, f자료형_문자열(T8428OutBlock{}))
	lib.F테스트_같음(t, P자료형_T8428OutBlock1, f자료형_문자열(T8428OutBlock1{}))
	lib.F테스트_같음(t, P자료형_T8436_현물_종목조회_응답_반복값, f자료형_문자열(T8436_현물_종목조회_응답_반복값{}))
	lib.F테스트_같음(t, P자료형_T8436_현물_종목조회_응답_반복값_모음, f자료형_문자열(T8436_현물_종목조회_응답_반복값_모음{}))
	lib.F테스트_같음(t, P자료형_T8436OutBlock, f자료형_문자열(T8436OutBlock{}))
}

func f자료형_문자열(값 interface{}) string {
	if 값 == nil {
		return "nil"
	}

	자료형 := reflect.TypeOf(값).String()
	시작_인덱스 := strings.Index(자료형, ".") + 1

	return 자료형[시작_인덱스:]
}

func TestT재무순위_구분(t *testing.T) {
	lib.F테스트_같음(t, P재무순위_PEG.String(), "PEG")
	lib.F테스트_같음(t, P재무순위_PEG.T3341(), "b")
}
