package lib

import (
	"testing"
	"time"
)

func TestP자료형_문자열(t *testing.T) {
	F테스트_같음(t, P자료형_Int, F자료형_문자열_단순형(0))
	F테스트_같음(t, P자료형_Int64, F자료형_문자열_단순형(int64(0)))
	F테스트_같음(t, P자료형_Float64, F자료형_문자열_단순형(float64(0.0)))
	F테스트_같음(t, P자료형_Bool, F자료형_문자열_단순형(true))
	F테스트_같음(t, P자료형_String, F자료형_문자열_단순형(""))
	F테스트_같음(t, P자료형_StringArray, F자료형_문자열_단순형([]string{}))
	F테스트_같음(t, P자료형_Time, F자료형_문자열_단순형(time.Time{}))
	F테스트_같음(t, P자료형_T신호, F자료형_문자열_단순형(T신호(0)))
	F테스트_같음(t, P자료형_S질의값_기본형, F자료형_문자열_단순형(S질의값_기본형{}))
	F테스트_같음(t, P자료형_S질의값_문자열, F자료형_문자열_단순형(S질의값_문자열{}))
	F테스트_같음(t, P자료형_S질의값_문자열_모음, F자료형_문자열_단순형(S질의값_문자열_모음{}))
	F테스트_같음(t, P자료형_S질의값_바이트_변환, F자료형_문자열_단순형(S질의값_바이트_변환{}))
	F테스트_같음(t, P자료형_S질의값_바이트_변환_모음, F자료형_문자열_단순형(S질의값_바이트_변환_모음{}))
	F테스트_같음(t, P자료형_S질의값_단일_종목, F자료형_문자열_단순형(S질의값_단일_종목{}))
	F테스트_같음(t, P자료형_S질의값_복수_종목, F자료형_문자열_단순형(S질의값_복수_종목{}))
	F테스트_같음(t, P자료형_S질의값_정상_주문, F자료형_문자열_단순형(S질의값_정상_주문{}))
	F테스트_같음(t, P자료형_S질의값_정정_주문, F자료형_문자열_단순형(S질의값_정정_주문{}))
	F테스트_같음(t, P자료형_S질의값_취소_주문, F자료형_문자열_단순형(S질의값_취소_주문{}))
	F테스트_같음(t, P자료형_S콜백_기본형, f자료형_문자열(S콜백_기본형{}))
	F테스트_같음(t, P자료형_S콜백_정수값, f자료형_문자열(S콜백_정수값{}))
	F테스트_같음(t, P자료형_S콜백_문자열, f자료형_문자열(S콜백_문자열{}))
	F테스트_같음(t, P자료형_S콜백_TR데이터, f자료형_문자열(S콜백_TR데이터{}))
	F테스트_같음(t, P자료형_S콜백_메시지_및_에러, f자료형_문자열(S콜백_메시지_및_에러{}))
}
