package lib

import (
	"strings"
	"testing"
)

func TestI문자열_집합(t *testing.T) {
	t.Parallel()

	문자열_집합 := New문자열_집합()

	문자열_집합.S추가("테스트1")
	문자열_집합.S추가("테스트2")
	문자열_집합.S추가("테스트3")
	문자열_집합.S추가("테스트4")
	문자열_집합.S추가("테스트1")
	문자열_집합.S추가("테스트1")

	F테스트_같음(t, 문자열_집합.G길이(), 4)
	F테스트_참임(t, 문자열_집합.G포함("테스트1"))
	F테스트_참임(t, 문자열_집합.G포함("테스트2"))
	F테스트_참임(t, 문자열_집합.G포함("테스트3"))
	F테스트_참임(t, 문자열_집합.G포함("테스트4"))
	F테스트_거짓임(t, 문자열_집합.G포함("포함되지_않은_문자열"))

	출력_문자열 := 문자열_집합.String()
	F테스트_참임(t, 출력_문자열[:1] == "[")
	F테스트_참임(t, 출력_문자열[len(출력_문자열)-1:] == "]")
	F테스트_참임(t, 출력_문자열[len(출력_문자열)-2:] != ",")
	F테스트_참임(t, 출력_문자열[len(출력_문자열)-2:] != " ")
	F테스트_참임(t, strings.Contains(출력_문자열, "테스트1"))
	F테스트_참임(t, strings.Contains(출력_문자열, "테스트2"))
	F테스트_참임(t, strings.Contains(출력_문자열, "테스트3"))
	F테스트_참임(t, strings.Contains(출력_문자열, "테스트4"))
	F테스트_거짓임(t, strings.Contains(출력_문자열, "포함되지_않은_문자열"))

	값_모음 := 문자열_집합.G슬라이스()
	값_확인 := true

	for _, 값 := range 값_모음 {
		switch 값 {
		case "테스트1", "테스트2", "테스트3", "테스트4":
			continue
		}

		값_확인 = false
		break
	}

	F테스트_참임(t, 값_확인, 문자열_집합)

	문자열_집합.S삭제("테스트2")
	F테스트_같음(t, 문자열_집합.G길이(), 3)
	F테스트_참임(t, 문자열_집합.G포함("테스트1"))
	F테스트_거짓임(t, 문자열_집합.G포함("테스트2"))
	F테스트_참임(t, 문자열_집합.G포함("테스트3"))
	F테스트_참임(t, 문자열_집합.G포함("테스트4"))
	F테스트_거짓임(t, 문자열_집합.G포함("포함되지_않은_문자열"))

	값_모음 = 문자열_집합.G슬라이스()
	값_확인 = true

	for _, 값 := range 값_모음 {
		switch 값 {
		case "테스트1", "테스트3", "테스트4":
			continue
		}

		값_확인 = false
		break
	}

	F테스트_참임(t, 값_확인, 문자열_집합)

	출력_문자열 = 문자열_집합.String()
	F테스트_참임(t, 출력_문자열[:1] == "[")
	F테스트_참임(t, 출력_문자열[len(출력_문자열)-1:] == "]")
	F테스트_참임(t, 출력_문자열[len(출력_문자열)-2:] != ",")
	F테스트_참임(t, 출력_문자열[len(출력_문자열)-2:] != " ")
	F테스트_참임(t, strings.Contains(출력_문자열, "테스트1"))
	F테스트_거짓임(t, strings.Contains(출력_문자열, "테스트2"))
	F테스트_참임(t, strings.Contains(출력_문자열, "테스트3"))
	F테스트_참임(t, strings.Contains(출력_문자열, "테스트4"))
	F테스트_거짓임(t, strings.Contains(출력_문자열, "포함되지_않은_문자열"))
}
