package internal

import (
	"time"
)

const wmca_dll = "wmca.dll"
const 실행_성공 = "completed successfully"
const P30초 = 30 * time.Second

const (
	P상한 byte = 0x18
	P상승 byte = 0x1E
	P보합 byte = 0x20
	P하한 byte = 0x19
	P하락 byte = 0x1F
)

// 질의 종류
const (
	P질의_접속 int = iota
	P질의_접속_해제
	P질의_조회
	P질의_실시간_서비스_등록
	P질의_실시간_서비스_해제
	P질의_실시간_서비스_모두_해제
)

// 회신 종류
const (
	P회신_접속 = "C"
	P회신_접속_해제 = "D"
	P회신_메시지 = "M"
	P회신_조회 = "Q"
	P회신_실시간_데이터 = "R"
	P회신_완료 = "P"
	P회신_에러 = "O"
	P회신_소켓_에러 = "S"
	P회신_종료 = "Q"
)

const (
	// 시세 조회 TR
	TR주식_현재가_조회 = "c1101"
	TR선물_현재가_조회 = "s4101"
	TR선물_스프레드_현재가_조회 = "c4113"
	TR옵션_현재가_조회 = "s4201"
	TR주식선물_현재가_조회 = "c4801"
	TR주식선물_스프레드_현재가_조회 = "c4805"
	TR_ELW_현재가_조회 = "s1701"
	TR선물_옵션_코드_조회 = "p1003"
	TR_ETF_현재가_조회 = "c1151"
	
	// 실시간 시세 TR
	RT코스피_호가_잔량 = "h1"
	RT코스닥_호가_잔량 = "k3"
	RT코스피_시간외_호가_잔량 = "h2"
	RT코스닥_시간외_호가_잔량 = "k4"
	RT코스피_예상_호가_잔량 = "h3"
	RT코스닥_예상_호가_잔량 = "k5"
	RT코스피_체결 = "j8"
	RT코스닥_체결 = "k8"
	RT코스피_선물_호가 = "f1"
	RT코스피_선물_이론가 = "f3"
	RT코스피_선물_미결제_약정 = "f4"
	RT코스피_선물_체결 = "f8"
	RT코스피_선물_스프레드_호가 = "q1"
	RT코스피_선물_스프레드_체결 = "q2"
	RT코스피_옵션_호가 = "o1"
	RT코스피_옵션_체결 = "o2"
	RT코스피_옵션_이론가 = "o3"
	RT코스피_옵션_미결제_약정 = "o4"
	RT주식선물_호가 = "vH"	
	RT주식선물_체결 = "vC"	
	RT주식선물_이론가 = "vV"	
	RT주식선물_미결제약정 = "vM"	
	RT주식선물_스프레드_호가 = "v7"	
	RT주식선물_스프레드_체결 = "v8"	
	RT_ELW_체결 = "eC"	
	RT_ELW_호가 = "eH"	
	RT_ELW_이론가 = "eV"	
	RT_ELW_투자지표 = "eL"	
	RT_ELW_실시간_거래원 = "eT"	
	RT코스피_선물_예상_체결 = "fE"	
	RT코스피_옵션_예상_체결 = "oE"	
	RT코스피_주식선물_예상_체결 = "vE"
	RT코스피_ETF_NAV = "j1"
	RT코스닥_ETF_NAV = "j0"
	RT선물_단계별_상하한가 = "f7"
	RT옵션_단계별_상하한가 = "o7"
	RT주식선물_단계별_상하한가 = "vI"
 	RT코스피_지수 = "u1"
 	RT코스닥_지수 = "k1"
 	
 	// 주문 관련 TR
 	TR주식_매도 = "c8101"	
	TR주식_매수 = "c8102"
	TR주식_정정 = "c8103"
	TR주식_취소 = "c8104"
	TR_ELW_매도 = "c8141"
	TR_ELW_매수 = "c8142"
	TR_ELW_정정_취소 = "c8143"
	TR주식_잔고_조회 = "c8201"
	TR주식_주문_체결_조회 = "s8120"
	TR매도_가능_수량 = "p8101"
	TR매수_가능_수량 = "p8105"
	TR개별_주식_매도_수량__현금주식_only = "p8104"
	TR선물_옵션_주식선물_주식옵션_매도_매수_주문 = "s8301"
	TR선물_옵션_주식선물_주식옵션_정정_취소_주문 = "s8302"
	TR선물옵션_주식선물_주식옵션_잔고_조회 = "c8311"
	TR선물옵션_주식선물_주식옵션_주문_체결_조회 = "c8322"
	TR선물옵션_주식선물_주식옵션_주문_가능_수량_조회 = "p8301"
	TR선물옵션_주식선물_주식옵션_청산_가능_수량_조회 = "p8302"

	// 주문 및 체결 실시간 TR
	RT주문_확인 = "d3"	// 증권사가 보냄.
	RT체결_확인 = "d2"	// 거래소가 보냄.
)