package internal

import (
	공용 "github.com/ghts/ghts/common"

	"strings"
	"testing"
)

func f접속_확인() {
	if !f접속됨() {
		질의 := 공용.New질의_가변형(P30초, 공용.P메시지_GET, 테스트용_ID, 테스트용_암호, 테스트용_공인인증_암호)
		질의.S질의(Ch접속)
		질의.G회신()	// 메시지
		질의.G회신()	// 로그인 정보
		
		if !f접속됨() {
			panic("접속 시도 실패")
		}
	}
}

func Test_Ch접속(테스트 *testing.T) {
	if f접속됨() {
		공용.New질의_가변형(P30초, 공용.P메시지_GET).S질의(Ch접속_해제).G회신()
	}

	질의 := 공용.New질의_가변형(P30초, 공용.P메시지_GET, 테스트용_ID, 테스트용_암호, 테스트용_공인인증_암호)
	질의.S질의(Ch접속)
	
	for 질의.G회신_종료() {
		회신 := 질의.G회신()
		공용.F테스트_에러없음(테스트, 회신.G에러())
		
		switch 회신.G구분() {
		case P회신_접속:
			공용.F테스트_같음(테스트, 회신.G구분(), P회신_접속)
			공용.F테스트_같음(테스트, 회신.G길이(), 1)
			
			로그인_정보, ok := 회신.G내용(0).(S로그인_정보)
			공용.F테스트_참임(테스트, ok)
			공용.F테스트_같음(테스트, 로그인_정보.G접속_ID(), 테스트용_ID)
			공용.F테스트_참임(테스트, strings.HasPrefix(로그인_정보.G접속_서버(), "mt")) //??
			공용.F테스트_참임(테스트, len(로그인_정보.G계좌_목록()) > 0)
		
			테스트용_계좌_인덱스 := -1
			for 인덱스, 계좌_정보 := range 로그인_정보.G계좌_목록() {
				if 계좌_정보.G계좌_번호() == 테스트용_계좌_번호 {
					테스트용_계좌_인덱스 = 인덱스 + 1 //계좌번호 인덱스는 '1'부터 시작됩니다.
					break
				}
			}
		
			공용.F테스트_참임(테스트, 테스트용_계좌_인덱스 > 0)
			
			// 접속 되었는 지 확인
			공용.F테스트_참임(테스트, f접속됨())
			
			회신 := 공용.New질의_가변형(P30초, 공용.P메시지_GET).S질의(Ch접속됨).G회신()
			공용.F테스트_에러없음(테스트, 회신.G에러())
			공용.F테스트_참임(테스트, 회신.G내용(0).(bool))
		case P회신_메시지:
			공용.F테스트_같음(테스트, 회신.G길이(), 2)
			
			_, ok := 회신.G내용(0).(string)	// 코드
			공용.F테스트_참임(테스트, ok)
			
			메시지, ok := 회신.G내용(1).(string)	// 메시지
			공용.F테스트_참임(테스트, ok)
			
			공용.F테스트_참임(테스트, strings.Contains(메시지, "로그인"))
			공용.F테스트_참임(테스트, strings.Contains(메시지, "성공"))
		default:
			공용.F문자열_출력("예상하지 못한 회신 종류 %v", 회신.G구분())
			테스트.FailNow()
		}
	}	
}

func TestCh조회_주식_현재가(테스트 *testing.T) {
	f접속_확인()
	
	종목_코드 := 공용.F임의_종목().G코드()
	
	공용.F문자열_출력("종목 코드 : %v", 종목_코드)
	
	질의 := 공용.New질의_가변형(P30초, 공용.P메시지_GET, TR주식_현재가_조회, 종목_코드)
	질의.S질의(Ch조회)
	
	i := 0
	for !질의.G회신_종료() {
		회신 := 질의.G회신()
		공용.F테스트_에러없음(테스트, 회신.G에러())
		
		switch 회신.G구분() {
		case P회신_조회:
			공용.F문자열_출력("*** %v 조회 데이터 콜백 ***", i); i++	// 디버깅
		case P회신_완료:
			공용.F문자열_출력("*** %v 완료 콜백 ***", i); i++	// 디버깅
			/*
			공용.F테스트_같음(테스트, 회신.G길이(), 1)
			
			데이터_블록, ok := 회신.G내용(0).(S수신_데이터)
			공용.F테스트_참임(테스트, ok)
			
			공용.F테스트_같음(테스트, 데이터_블록.G블록_이름(), "c1101")
			
			데이터, ok := 데이터_블록.G데이터().(*S주식_현재가_조회)
			공용.F테스트_참임(테스트, ok)
			
			질의 := 데이터.M질의
			
			공용.F문자열_출력("*** 질의 ***")
			공용.F변수값_확인(질의)
			
			기본_자료 := 데이터.M기본_자료
			
			공용.F문자열_출력("*** 기본 자료 ***")
			공용.F변수값_확인(기본_자료)
			
			
			//TODO
			//변동_거래량_자료 := 데이터.M변동_거래량_자료
			//종목_지표 := 데이터.M종목_지표
			
			//공용.F테스트_같음(테스트, 질의.G언어(), "K")
			//공용.F테스트_같음(테스트, 질의.G종목_코드(), 종목_코드)
			공용.F테스트_같음(테스트, 질의.M언어, "K")
			공용.F테스트_같음(테스트, 질의.M종목_코드, 종목_코드)
			
			공용.F테스트_같음(테스트, 기본_자료.M종목_코드, 종목_코드)
			공용.F테스트_참임(테스트, 기본_자료.M상한가 > 0)
			공용.F테스트_참임(테스트, 기본_자료.M시가 > 0)
			공용.F테스트_참임(테스트, 기본_자료.M고가 > 0)
			공용.F테스트_참임(테스트, 기본_자료.M저가 > 0)
			공용.F테스트_참임(테스트, 기본_자료.M하한가 > 0)
			공용.F테스트_참임(테스트, 기본_자료.M상한가 >= 기본_자료.M고가)
			공용.F테스트_참임(테스트, 기본_자료.M고가 >= 기본_자료.M시가)
			공용.F테스트_참임(테스트, 기본_자료.M고가 >= 기본_자료.M저가)
			공용.F테스트_참임(테스트, 기본_자료.M저가 >= 기본_자료.M하한가)
			공용.F테스트_참임(테스트, 기본_자료.M거래량 > 0)
			거래대금_근사값 := 기본_자료.M거래량 * 기본_자료.M시가
			공용.F테스트_참임(테스트, 기본_자료.M거래대금 > (거래대금_근사값 / 2))
			공용.F테스트_참임(테스트, 기본_자료.M거래대금 < (거래대금_근사값 * 2))
			
			공용.F테스트_참임(테스트, 기본_자료.M가중_평균_가격 >= 기본_자료.M저가)
			공용.F테스트_참임(테스트, 기본_자료.M가중_평균_가격 <= 기본_자료.M고가)
			
			공용.F테스트_참임(테스트, 기본_자료.M5일_고가 >=  기본_자료.M고가)
			공용.F테스트_참임(테스트, 기본_자료.M20일_고가 >= 기본_자료.M5일_고가)
			공용.F테스트_참임(테스트, 기본_자료.M52주_고가 >= 기본_자료.M20일_고가)
			공용.F테스트_참임(테스트, 기본_자료.M연중_최고가 >= 기본_자료.M고가)
			
			공용.F테스트_참임(테스트, 기본_자료.M5일_저가 <=  기본_자료.M저가)
			공용.F테스트_참임(테스트, 기본_자료.M20일_저가 <= 기본_자료.M5일_저가)
			공용.F테스트_참임(테스트, 기본_자료.M52주_저가 <= 기본_자료.M20일_저가)
			공용.F테스트_참임(테스트, 기본_자료.M연중_최저가 <= 기본_자료.M저가)
			
						
			// TODO 추가 확인
			//변동_거래량_자료 := 데이터.M변동_거래량_자료
			//종목_지표 := 데이터.M종목_지표
			*/
		case P회신_메시지:
			공용.F문자열_출력("*** %v 메시지 콜백 ***", i); i++	// 디버깅
			
			공용.F테스트_같음(테스트, 회신.G길이(), 2)
			
			_, ok := 회신.G내용(0).(string)
			공용.F테스트_참임(테스트, ok)
			
			_, ok = 회신.G내용(1).(string)
			공용.F테스트_참임(테스트, ok)
		default:
			공용.F문자열_출력("*** %v 예상치 못한 경우 ***", i); i++	// 디버깅
			
			공용.F문자열_출력("예상하지 못한 회신 종류 %v", 회신.G구분())
			테스트.FailNow()
		}
	}	
}


// 제일 마지막에 실행되도록 제일 아래에 배치.
func TestCh접속_해제(테스트 *testing.T) {
	f접속_확인()
	
	질의 := 공용.New질의_가변형(P30초, 공용.P메시지_GET)
	질의.S질의(Ch접속_해제)
	질의.G회신()
	
	회신 := 공용.New질의_가변형(P30초, 공용.P메시지_GET).S질의(Ch접속됨).G회신()
	공용.F테스트_에러없음(테스트, 회신.G에러())
	공용.F테스트_거짓임(테스트, 회신.G내용(0).(bool))
	공용.F테스트_거짓임(테스트, f접속됨())
}