package xing

import (
	"github.com/ghts/ghts/lib"
	mt "github.com/ghts/ghts/lib/market_time"
	"github.com/ghts/ghts/xing/base"
	"testing"
)

func TestCSPAT00800_현물_취소_주문_질의값(t *testing.T) {
	t.Parallel()

	_, ok := interface{}(new(lib.S질의값_취소_주문)).(lib.I질의값)
	lib.F테스트_참임(t, ok)
}

func TestCSPAT00800_현물_취소_주문(t *testing.T) {
	t.Parallel()

	if xt.F서버_구분() == xt.P서버_실거래 ||
		!F금일_한국증시_개장() ||
		!mt.F한국증시_정규_거래_시간임() {
		t.SkipNow()
	}

	lib.F테스트_에러없음(t, F주문_응답_실시간_정보_구독())

	var 종목 = lib.New종목("069500", "KODEX 200", lib.P시장구분_ETF)

	하한가, ok := 하한가_맵[종목.G코드()]
	lib.F테스트_참임(t, ok, "하한가를 찾을 수 없음. %v", 종목.G코드())

	const 수량_정상주문 = int64(25)
	const 수량_일부_취소_주문 = int64(10)
	const 수량_전량_취소_주문 = 수량_정상주문 - 수량_일부_취소_주문
	var 가격_정상주문 = 하한가

	계좌번호, 에러 := F계좌_번호(0)
	lib.F테스트_에러없음(t, 에러)

	//계좌_상세명, 에러 := F계좌_상세명(계좌번호)
	//lib.F확인(에러)
	//lib.F테스트_거짓임(t, strings.Contains(계좌_상세명, "선물옵션")) // 현물 계좌이어야 함.

	질의값 := xt.NewCSPAT00600_현물_정상_주문_질의값()
	질의값.M계좌번호 = 계좌번호
	질의값.M종목코드 = 종목.G코드()
	질의값.M주문수량 = 수량_정상주문
	질의값.M주문단가 = 가격_정상주문 // 시장가 주문 시 가격은 무조건 '0'을 입력해야 함.
	질의값.M매도_매수_구분 = lib.P매수
	질의값.M호가유형 = lib.P호가_지정가
	질의값.M신용거래_구분 = xt.P신용거래_해당없음
	질의값.M주문조건 = lib.P주문조건_없음 // 모의투자에서는 IOC, FOK를 사용할 수 없음.
	질의값.M대출일 = ""            // 신용주문이 아닐 경우는 NewCSPAT00600InBlock1()에서 공백문자로 바꿔줌.

	정상주문_응답값, 에러 := TrCSPAT00600_현물_정상주문(질의값)
	lib.F테스트_에러없음(t, 에러)
	lib.F테스트_참임(t, 정상주문_응답값.M응답2.M주문번호 > 0, 정상주문_응답값.M응답2.M주문번호)

	lib.F대기(lib.P100밀리초)

	질의값_취소주문 := lib.New질의값_취소_주문()
	질의값_취소주문.M구분 = xt.TR주문
	질의값_취소주문.M코드 = xt.TR현물_취소_주문_CSPAT00800
	질의값_취소주문.M원주문번호 = 정상주문_응답값.M응답2.M주문번호
	질의값_취소주문.M계좌번호 = 계좌번호
	질의값_취소주문.M종목코드 = 종목.G코드()
	질의값_취소주문.M주문수량 = 수량_일부_취소_주문

	취소주문_응답값, 에러 := TrCSPAT00800_현물_취소주문(질의값_취소주문)
	lib.F테스트_에러없음(t, 에러)
	lib.F테스트_참임(t, 취소주문_응답값.M응답2.M주문번호 > 0, 취소주문_응답값.M응답2.M주문번호)

	lib.F대기(lib.P100밀리초)

	// 전량 취소주문 TR 실행
	질의값_취소주문 = lib.New질의값_취소_주문()
	질의값_취소주문.M구분 = xt.TR주문
	질의값_취소주문.M코드 = xt.TR현물_취소_주문_CSPAT00800
	질의값_취소주문.M원주문번호 = 정상주문_응답값.M응답2.M주문번호
	질의값_취소주문.M계좌번호 = 계좌번호
	질의값_취소주문.M종목코드 = 종목.G코드()
	질의값_취소주문.M주문수량 = 수량_전량_취소_주문

	취소주문_응답값, 에러 = TrCSPAT00800_현물_취소주문(질의값_취소주문)
	lib.F테스트_에러없음(t, 에러)
	lib.F테스트_참임(t, 취소주문_응답값.M응답2.M주문번호 > 0, 취소주문_응답값.M응답2.M주문번호)

	lib.F대기(lib.P100밀리초)

	lib.F테스트_에러없음(t, F주문_응답_실시간_정보_해지())
}
