package xing

import (
	"testing"
	"time"

	lb "github.com/ghts/ghts/lib"
	xt "github.com/ghts/ghts/xing/base"
)

func TestCSPAQ12300_현물계좌_잔고내역_질의값(t *testing.T) {
	_, ok := interface{}(new(xt.CSPAQ12300_현물계좌_잔고내역_질의값)).(lb.I질의값)
	lb.F테스트_참임(t, ok)
}

func TestCSPAQ12300_현물계좌_잔고내역_조회(t *testing.T) {
	const 수량 = 5
	const 가격_정상주문 = int64(0) // 현재가 주문은 가격이 0
	const 호가_유형 = lb.P호가_시장가

	계좌번호, 에러 := F계좌_번호(0)
	lb.F테스트_에러없음(t, 에러)

	값_모음, 에러 := TrCSPAQ12300_현물계좌_잔고내역_조회(계좌번호, xt.CSPAQ12300_평균_단가, false)
	lb.F테스트_에러없음(t, 에러)

	// 모의투자 세금은 0.25%, 수수료는 0.35% 입니다. 0.6%로 계산하면 됨.

	for 종목코드, 값 := range 값_모음 {
		lb.F테스트_같음(t, 종목코드, 값.M종목코드)
		lb.F테스트_참임(t, F종목코드_존재함(값.M종목코드), 값.M종목코드)
		lb.F테스트_다름(t, 값.M종목명, "")
		lb.F테스트_다름(t, 값.M유가증권잔고유형코드, "")
		lb.F테스트_다름(t, 값.M유가증권잔고유형명, "")
		lb.F테스트_참임(t, 값.M잔고수량 >= 0)
		lb.F테스트_참임(t, 값.M매매기준잔고수량 >= 0)
		lb.F테스트_참임(t, 값.M금일매수체결수량 >= 0)
		lb.F테스트_참임(t, 값.M금일매도체결수량 >= 0)
		lb.F테스트_참임(t, 값.M매도가 >= 0)
		lb.F테스트_참임(t, 값.M매수가 >= 0)

		평가손익 := 값.M손익율 * 값.M현재가 * float64(값.M매매기준잔고수량)
		lb.F테스트_참임(t, lb.F오차율_퍼센트(평가손익, float64(값.M평가손익)) < 3)
		lb.F테스트_참임(t, 값.M현재가 > 0)
		lb.F테스트_참임(t, 값.M신용금액 >= 0)
		lb.F테스트_참임(t, 값.M만기일.Equal(time.Time{}) || 값.M만기일.After(F당일()))
		lb.F테스트_참임(t, 값.M전일매도체결가 >= 0)
		lb.F테스트_참임(t, 값.M전일매도수량 >= 0)
		lb.F테스트_참임(t, 값.M전일매수체결가 >= 0)
		lb.F테스트_참임(t, 값.M전일매수수량 >= 0)
		lb.F테스트_참임(t, 값.M대출일.Equal(time.Time{}) || 값.M대출일.Equal(F당일()))
		lb.F테스트_참임(t, 값.M평균단가 >= 0)
		lb.F테스트_참임(t, 값.M매도가능수량 >= 0)
		lb.F테스트_참임(t, 값.M매도주문수량 >= 0)
		lb.F테스트_참임(t, 값.M금일매수체결금액 >= 0)
		lb.F테스트_참임(t, 값.M금일매도체결금액 >= 0)
		lb.F테스트_참임(t, 값.M전일매수체결금액 >= 0)
		lb.F테스트_참임(t, 값.M전일매도체결금액 >= 0)
		lb.F테스트_참임(t, 값.M잔고평가금액 > 0)
		lb.F테스트_참임(t, 값.M현금주문가능금액 >= 0)
		lb.F테스트_참임(t, 값.M주문가능금액 >= 0)
		lb.F테스트_참임(t, 값.M매도미체결수량 >= 0)
		lb.F테스트_참임(t, 값.M매도미결제수량 >= 0)
		lb.F테스트_참임(t, 값.M매수미체결수량 >= 0)
		lb.F테스트_참임(t, 값.M매수미결제수량 >= 0)
		lb.F테스트_참임(t, 값.M미결제수량 <= 0, 값.M미결제수량) // 음수가 나오는 데 무슨 의미인지 모르겠음.
		lb.F테스트_참임(t, 값.M미체결수량 >= 0)
		lb.F테스트_참임(t, 값.M전일종가 > 0)
		lb.F테스트_참임(t, 값.M매입금액 > 0)
		lb.F테스트_같음(t, 값.M등록시장코드,
			xt.CSPAQ12300_코스피, xt.CSPAQ12300_코스닥, xt.CSPAQ12300_코넥스,
			xt.CSPAQ12300_K_OTC, xt.CSPAQ12300_채권, xt.CSPAQ12300_비상장)
		lb.F테스트_같음(t, 값.M대출상세분류코드,
			xt.CSPAQ12300_대출없음, xt.CSPAQ12300_유통융자,
			xt.CSPAQ12300_자기융자, xt.CSPAQ12300_예탁주식담보융자)
		lb.F테스트_참임(t, 값.M예탁담보대출수량 >= 0)
	}
}
