package xing

import (
	lb "github.com/ghts/ghts/lib"
	"github.com/ghts/ghts/xing/base"

	"testing"
	"time"
)

func TestT1310_현물_당일전일_분틱_조회(t *testing.T) {
	t.Parallel()

	종목코드 := F임의_종목().G코드()
	당일전일_구분 := ([]xt.T당일_전일_구분{xt.P당일전일구분_당일, xt.P당일전일구분_전일})[lb.F임의_범위_이내_정수값(0, 1)]
	분틱_구분 := ([]xt.T분틱_구분{xt.P분틱구분_분, xt.P분틱구분_틱})[lb.F임의_범위_이내_정수값(0, 1)]
	var 종료시각 time.Time

	if 당일전일_구분 == xt.P당일전일구분_당일 {
		종료시각 = lb.F확인2(lb.F2일자별_시각(F당일(), "15:04:05", "00:00:00"))
		종료시각 = 종료시각.AddDate(0, 0, 1).Add(-1 * lb.P1초)
	} else {
		종료시각 = lb.F확인2(lb.F2일자별_시각(F전일(), "15:04:05", "00:00:00")).Add(-1 * lb.P1초)
	}

	값_모음, 에러 := TrT1310_현물_당일전일_분틱_조회(종목코드, 당일전일_구분, 분틱_구분, 종료시각, 70)
	lb.F테스트_에러없음(t, 에러)

	const 일자_포맷_문자열 = "2006/01/02"

	for _, 값 := range 값_모음 {
		switch 당일전일_구분 {
		case xt.P당일전일구분_당일:
			lb.F테스트_참임(t, lb.F2일자(값.M시각).Equal(F당일()), 값.M시각, F당일())
		case xt.P당일전일구분_전일:
			lb.F테스트_참임(t, lb.F2일자(값.M시각).Equal(F전일()), 값.M시각, F전일())
		default:
			panic(lb.New에러("예상하지 못한 경우. '%v'", 값.M시각))
		}

		lb.F테스트_참임(t, 값.M시각.After(종료시각.AddDate(0, 0, -1)))
		lb.F테스트_참임(t, 값.M시각.Before(종료시각.Add(lb.P3분)), 값.M시각, 종료시각.Add(lb.P3분))

		lb.F테스트_참임(t, 값.M현재가 > 0)
		lb.F테스트_같음(t, 값.M전일대비구분, xt.P구분_상한, xt.P구분_상승, xt.P구분_보합, xt.P구분_하한, xt.P구분_하락)

		switch 값.M전일대비구분 {
		case xt.P구분_상한, xt.P구분_상승:
			lb.F테스트_참임(t, 값.M전일대비등락폭 > 0)
			lb.F테스트_참임(t, 값.M전일대비등락율 > 0)
			lb.F테스트_참임(t, 값.M전일대비등락율 < 30)
		case xt.P구분_하한, xt.P구분_하락:
			lb.F테스트_참임(t, 값.M전일대비등락폭 < 0,
				값.M전일대비구분, uint8(값.M전일대비구분), 값.M전일대비등락폭, 값)
			lb.F테스트_참임(t, 값.M전일대비등락율 < 0,
				값.M전일대비구분, 값.M전일대비등락율)
			lb.F테스트_참임(t, 값.M전일대비등락율 > -30,
				값.M전일대비구분, 값.M전일대비등락율)
		case xt.P구분_보합:
			lb.F테스트_같음(t, 값.M전일대비등락폭, 0)
			lb.F테스트_참임(t, 값.M전일대비등락율 < 1)
		default:
			panic("예상하지 못한 경우.")
		}

		lb.F테스트_참임(t, 값.M체결수량 >= 0)

		// 게시판 답변 : 체결강도 = 매수체결량/매도체결량*100 입니다.
		if 값.M매도체결수량 != 0 {
			체결강도_예상값 := float64(값.M매수체결수량) / float64(값.M매도체결수량) * 100

			lb.F테스트_참임(t,
				lb.F오차(값.M체결강도, 체결강도_예상값) < 0.01 ||
					lb.F오차율_퍼센트(값.M체결강도, 체결강도_예상값) < 3,
				값.M체결강도, 체결강도_예상값,
				값.M매수체결수량,
				값.M매도체결수량)
		}

		lb.F테스트_참임(t, 값.M거래량 >= 0)

		if 값.M매도체결수량 > 0 {
			lb.F테스트_참임(t, 값.M매도체결건수 > 0)
		}

		if 값.M매도체결건수 > 0 {
			lb.F테스트_참임(t, 값.M매도체결수량 > 0)
		}

		if 값.M매수체결수량 > 0 {
			lb.F테스트_참임(t, 값.M매수체결건수 > 0)
		}

		if 값.M매수체결건수 > 0 {
			lb.F테스트_참임(t, 값.M매수체결수량 > 0)
		}

		lb.F테스트_같음(t, 값.M순체결량, 값.M매수체결수량-값.M매도체결수량)
		lb.F테스트_같음(t, 값.M순체결건수, 값.M매수체결건수-값.M매도체결건수)
	}
}
