package shared

func F샘플_종목_모음() []I종목 {
	샘플_종목_모음 := make([]I종목, 0)
	샘플_종목_모음 = append(샘플_종목_모음, F샘플_종목_1())
	샘플_종목_모음 = append(샘플_종목_모음, F샘플_종목_2())
	샘플_종목_모음 = append(샘플_종목_모음, F샘플_종목_3())
	샘플_종목_모음 = append(샘플_종목_모음, F샘플_종목_4())
	샘플_종목_모음 = append(샘플_종목_모음, F샘플_종목_5())

	return 샘플_종목_모음
}

func F샘플_종목_1() I종목 { return New종목("000020", "동화약품") }
func F샘플_종목_2() I종목 { return New종목("000030", "우리은행") }
func F샘플_종목_3() I종목 { return New종목("000040", "KR모터스") }
func F샘플_종목_4() I종목 { return New종목("000050", "경방") }
func F샘플_종목_5() I종목 { return New종목("000060", "메리츠화재") }
